{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "int32", "output_dim": 300, "trainable": true, "embeddings_regularizer": null, "input_dim": 92168, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 50], "activity_regularizer": null, "input_length": 50}}, {"class_name": "Dropout", "config": {"dtype": "float32", "batch_input_shape": [null, 50, 300], "trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 50, 300], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_2"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_1", "pool_size": [2]}, "name": "max_pooling1d_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_2", "pool_size": [2]}, "name": "max_pooling1d_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_3", "pool_size": [2]}, "name": "max_pooling1d_3"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3"}, {"class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}], ["flatten_3", 0, 0, {}]]], "config": {"name": "merge_1", "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "mode": "concat"}, "name": "merge_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["merge_1", 0, 0]]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 400, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4, "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}